## Feature Scaling
Feature Scaling is a technique of bringing down the values of all the independent features of our dataset on the same scale. Feature selection helps to do calculations in algorithms very quickly. It is the important stage of data preprocessing.
<figure>
    <center> <img src="https://miro.medium.com/max/1200/1*yR54MSI1jjnf2QeGtt57PA.png"  style="width:600px;height:400px;" ></center>
</figure>

## Outline
- [1 Project detail](#top_1)
- [&nbsp;&nbsp;1.1 Used Notations](#top_1.1)
- [&nbsp;&nbsp;1.2 Used Equations](#top_1.2)
- [2 Our Program](#top_2)
- [&nbsp;&nbsp;2.1 Import libraries](#top_2.1)
- [&nbsp;&nbsp;2.2 Load data](#top_2.2)
- [&nbsp;&nbsp;2.3 EDA](#top_2.3)
- [&nbsp;&nbsp;2.4 Define Variables](#top_2.4)
- [&nbsp;&nbsp;2.5 Feature Scaling](#top_2.5)
- [&nbsp;&nbsp;2.6 Define Model](#top_2.6)
- [&nbsp;&nbsp;2.7 Plot data with fit line](#top_2.7)

<a name="top_1"></a>
# 1. Project detail
---------------
In this prject we want to scale features of our dataset to obtain a better result.

Let's get started

<a name="top_1.1"></a>
## 1.1 Notations used in this project
------------
Here is a summary of some of the notation you will encounter.  

|General <img width=70/> <br />  Notation  <img width=70/> | Description<img width=350/>| Python (if applicable) |
|: ------------|: ------------------------------------------------------------||
|  $\mathbf{x}$ | Training Example feature values (in this lab - 97 items))  | `x_train` |   
|  $\mathbf{y}$  | Training Example  targets (in this lab lab - 97 items).  | `y_train` 
| m | Number of training examples | `m`|
| n | Number of features          | `n`|
|  $w$  |  parameter: weight,                                 | `w`    |
|  $b$           |  parameter: bias                                           | `b`    |     
| $f_{w,b}(x^{(i)})$ | The result of the model evaluation at $x^{(i)}$ parameterized by $w,b$: $f_{w,b}(x^{(i)}) = wx^{(i)}+b$  | `f_wb`

<a name="top_1.2"></a>
## 1.2  Equations Used in this project
 
 
 
 
-----------------
We have several different feature scaling methods, but two of which is defined
### 1st type: Normalization

$$ X_{new}= \frac {X-X_{min}}{X_{max}-X_{min}} \tag{1}$$


### 2nd type: Standardizatiom 
$$ X_{new}= \frac {X-X_{mean}}{Standard Deviation} \tag{2}$$

<a name="top_2"></a>
# 2. Our Program
Here you can see the code to run this model

<a name="top_2.1"></a>
## 2.1 Import libraries

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, MinMaxScaler
from sklearn.linear_model import LinearRegression

<a name="top_2.2"></a>
## 2.2 Load data

In [2]:
test_data = pd.read_csv('Feature_Scaling_test_data.csv')
train_data = pd.read_csv('Feature_Scaling_train_data.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<a name="top_2.3"></a>
## 2.3 EDA

In [3]:
# Let's see an inforamtion of this data
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
train_data.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [5]:
# Label Encoder for columns "Sex"and "Embarked"
Label_Encoder =  LabelEncoder()
train_data['Sex'] = Label_Encoder.fit_transform(train_data['Sex'])
train_data['Embarked'] = Label_Encoder.fit_transform(train_data['Embarked'])

In [6]:
# Reshape data frame and show it
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [7]:
# Beacuse we have Nan values in dataframe, we must remove them or replace with suitable values.
# Here, drop them is easier than the other method
train_data.dropna(inplace=True)
train_data = train_data[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','Survived']]
train_data.iloc[182]

Pclass       1.0000
Sex          0.0000
Age         56.0000
SibSp        0.0000
Parch        1.0000
Fare        83.1583
Embarked     0.0000
Survived     1.0000
Name: 879, dtype: float64

<a name="top_2.4"></a>
## 2.4 Define Variables

In [8]:
# Set x and y train
x_train = np.array(train_data.iloc[:,:-1])
y_train = np.array(train_data.iloc[:,-1]).reshape(-1,1)

# Set m and n
m = x_train.shape[0]
n = x_train.shape[1]

# ----------------------------------------
print(f'Number of training items: {m}')
print(f'Number of features: {n}')
print('\nFive rows of x: \n',x_train[:5])
print('\nFive rows of y: \n',y_train[:5])

Number of training items: 185
Number of features: 7

Five rows of x:
 [[ 1.      0.     38.      1.      0.     71.2833  0.    ]
 [ 1.      0.     35.      1.      0.     53.1     2.    ]
 [ 1.      1.     54.      0.      0.     51.8625  2.    ]
 [ 3.      0.      4.      1.      1.     16.7     2.    ]
 [ 1.      0.     58.      0.      0.     26.55    2.    ]]

Five rows of y:
 [[1]
 [1]
 [0]
 [1]
 [1]]

<a name="top_2.5"></a>
## 2.5 Feature Scaling

In [9]:
Scaler = MinMaxScaler()
train_data= pd.DataFrame(Scaler.fit_transform(train_data))

0    0.000000
1    0.000000
2    0.696510
3    0.000000
4    0.250000
5    0.162314
6    0.000000
7    1.000000
Name: 182, dtype: float64

In [11]:
train_data

       0    1         2         3     4         5         6    7
0    0.0  0.0  0.468892  0.333333  0.00  0.139136  0.000000  1.0
1    0.0  0.0  0.430956  0.333333  0.00  0.103644  0.666667  1.0
2    0.0  1.0  0.671219  0.000000  0.00  0.101229  0.666667  0.0
3    1.0  0.0  0.038948  0.333333  0.25  0.032596  0.666667  1.0
4    0.0  0.0  0.721801  0.000000  0.00  0.051822  0.666667  1.0
..   ...  ...       ...       ...   ...       ...       ...  ...
180  0.0  0.0  0.582701  0.333333  0.25  0.102579  0.666667  1.0
181  0.0  1.0  0.405665  0.000000  0.00  0.009759  0.666667  0.0
182  0.0  0.0  0.696510  0.000000  0.25  0.162314  0.000000  1.0
183  0.0  0.0  0.228629  0.000000  0.00  0.058556  0.666667  1.0
184  0.0  1.0  0.317147  0.000000  0.00  0.058556  0.000000  1.0

[185 rows x 8 columns]

<a name="top_2.6"></a>
## 2.4 Define Model

In [14]:
Regressor = LinearRegression()
Regression = Regressor.fit(x_train,y_train)
Regression.coef_

array([[-8.50498814e-02, -4.70395324e-01, -6.22032706e-03,
         1.70480607e-02, -5.84336792e-02,  2.48389337e-04,
        -2.04589331e-02]])